**ARQUIVO USADO PARA TESTARMOS E BRINCARMOS COM A BIBLIOTECA PANDAS

FUNÇÕES APRENDIDAS : SERIES (Para fácil entendimento, é uma tabela de banco de dados com apenas uma coluna e quantas linhas precisar)
                     DATAFRAME (Para fácil entendimento, nada mais nada menos do que uma tabela completa de banco de dados, podendo ser ótimo para leitura de informações provindas de datasets)

In [2]:
import pandas as pd
import numpy as np

In [4]:
serie_teste = pd.Series(np.random.random(10))

In [5]:
serie_teste

0    0.686298
1    0.976820
2    0.422032
3    0.836661
4    0.686899
5    0.399555
6    0.603694
7    0.940425
8    0.528754
9    0.942098
dtype: float64

In [6]:
serie_teste = pd.Series(np.random.random(3), index = ['random_1','random_2','random_3'])

In [7]:
serie_teste

random_1    0.212846
random_2    0.115352
random_3    0.699499
dtype: float64

In [12]:
dre_values = {'Receita_Bruta': 100000, 'Margem': 20, 'Receita_Liquida': 140000}
dre_ambev = pd.Series(dre_values)
dre_ambev

dre_values = {'Receita_Bruta': 102200, 'Margem': 25, 'Receita_Liquida': 120000}
dre_alb = pd.Series(dre_values)
dre_alb

Margem                 25
Receita_Bruta      102200
Receita_Liquida    120000
dtype: int64

In [31]:
dre_empresa = pd.DataFrame({'Ambev': dre_ambev, 'Air Liquide': dre_alb})
dre_empresa

                 Air Liquide   Ambev
Margem                    25      20
Receita_Bruta         102200  100000
Receita_Liquida       120000  140000

Podemos utilizar nas Series as funções que aprendemos em Numpy (Slice, Fancy Indexing, Masking), segue alguns exemplos abaixo:

In [20]:
serie_teste = pd.Series(np.random.random(10)) 
serie_teste[0:5]

0    0.550054
1    0.204893
2    0.339215
3    0.871581
4    0.022398
dtype: float64

In [21]:
serie_teste[(serie_teste > 0.10)]

0    0.550054
1    0.204893
2    0.339215
3    0.871581
5    0.430147
6    0.953771
7    0.601511
8    0.775511
9    0.318353
dtype: float64

In [22]:
serie_teste[[1,5]]

1    0.204893
5    0.430147
dtype: float64

Series.Loc: Usado para chamar a Serie pelo index nomeado, podendo utilizar Slices 
Series iLoc: Usado para chamar a Serie pelo index Python (0, 1, 2, 3 de acordo com a quantidade de valores)
Series iX: Usado para chamar a Serie pelo index tanto como o Loc quanto como iLoc. Terá melhor função nos DataFrame

In [23]:
serie_teste.loc[1]

0.20489316083772313

In [24]:
serie_teste.loc[1:3]

1    0.204893
2    0.339215
3    0.871581
dtype: float64

In [25]:
serie_teste.iloc[2]

0.33921525226945215

In [26]:
serie_teste.iloc[0]

0.550053519494428

In [29]:
serie_teste.ix[1]
               
#Podemos ver que a função ix foi depreciada

0.20489316083772313

Evite chamar as colunas do DataFrame pelo nome (dre['Ambev'] ao inves de dre.Ambev)

In [32]:
dre_empresa['Empresa'] = dre_empresa['Ambev'] + dre_empresa['Air Liquide']

In [33]:
dre_empresa

                 Air Liquide   Ambev  Empresa
Margem                    25      20       45
Receita_Bruta         102200  100000   202200
Receita_Liquida       120000  140000   260000

In [35]:
dre_empresa.T

#Troca colunas por linhas

             Margem  Receita_Bruta  Receita_Liquida
Air Liquide      25         102200           120000
Ambev            20         100000           140000
Empresa          45         202200           260000

In [36]:
dre_empresa.values

array([[    25,     20,     45],
       [102200, 100000, 202200],
       [120000, 140000, 260000]], dtype=int64)

In [38]:
dre_empresa.iloc[:2, :2]

               Air Liquide   Ambev
Margem                  25      20
Receita_Bruta       102200  100000

In [44]:
dre_empresa.ix[0,1]

c:\users\avell 1555 iron\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

20

In [46]:
dre_empresa.loc[:'Receita_Bruta', :'Ambev']

               Air Liquide   Ambev
Margem                  25      20
Receita_Bruta       102200  100000

In [47]:
dre_empresa.ix[:1, :'Ambev']

        Air Liquide  Ambev
Margem           25     20

In [50]:
dre_empresa.loc[dre_empresa.Ambev > 20, :'Empresa']

                 Air Liquide   Ambev  Empresa
Receita_Bruta         102200  100000   202200
Receita_Liquida       120000  140000   260000

Vamos utilizar Ufuncs para vermos de uma maneira melhor a relacao entre NumPy e Pandas

In [51]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [52]:
df = pd.DataFrame(rng.randint(0,10,(3,4)), columns = ['A','B','C','D'])

In [53]:
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [54]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [56]:
np.sin(df * np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

Para operações binárias em Series e DataFrame, o Pandas alinha os indices para que as estruturas se conversem, o que torna interessante quando tempos valores incompletos

In [58]:
margem = pd.Series({'Ambev':20, 'Air Liquide': 10, 'Empresa': 5}, name = 'Margem')

In [59]:
receita_bruta = pd.Series({'Ambev':100000, 'Air Liquide': 50000, 'Empresa': 150000}, name = 'ReceitaBruta')

In [60]:
receita_bruta/margem

Air Liquide     5000.0
Ambev           5000.0
Empresa        30000.0
dtype: float64

In [61]:
A = pd.Series([2,4,6], index = [0,1,2])

In [62]:
B = pd.Series([1,3,5], index = [1,2,3])

In [63]:
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [64]:
A.add(B, fill_value = 0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [65]:
A = pd.DataFrame(rng.randint(0, 20, (2,2)), columns=list('AB'))

In [66]:
B = pd.DataFrame(rng.randint(0,10, (3,3)), columns=list('ABC'))

In [67]:
A + B

      A     B   C
0   5.0  11.0 NaN
1  10.0   9.0 NaN
2   NaN   NaN NaN

In [68]:
A.stack()

0  A     1
   B    11
1  A     5
   B     1
dtype: int32

In [71]:
fill = A.stack().mean()

In [72]:
A.add(B, fill_value=fill)

      A     B     C
0   5.0  11.0  13.5
1  10.0   9.0   4.5
2  13.5   6.5  10.5